satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Utilities/STM32_EVAL/STM32_PRIMER2/stm32_primer2_lcd.c
/********************* (C) COPYRIGHT 2007 RAISONANCE S.A.S. *******************/
/**
*
* @file     lcd.c
* @brief    The LCD driver for the ST7637.
* @author   FL
* @date     07/2007
*
**/
/******************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "stm32_primer2_lcd.h"

/// @cond Internal

/* Private define ------------------------------------------------------------*/
#ifdef USE_STM32_PRIMER2
#define V9_MADCTRVAL                0xd0     /*!< Left orientation value.             */
#define V12_MADCTRVAL               0x70     /*!< Up orientation value.        MX+MV  */
#define V3_MADCTRVAL                0x10     /*!< Right orientation value.  MY+MX     */
#define V6_MADCTRVAL                0xB0     /*!< Bottom orientation value. MY+   MV  */
#else
#define V9_MADCTRVAL                0x90     /*!< Left orientation value.   MY        */
#define V12_MADCTRVAL               0x30     /*!< Up orientation value.           MV  */
#define V3_MADCTRVAL                0x50     /*!< Right orientation value.     MX     */
#define V6_MADCTRVAL                0xF0     /*!< Bottom orientation value. MY+MX+MV  */
#endif
#define BACKLIGHT_DIVIDER           500      /*!< LCD handler step.           */

/* Private variables ---------------------------------------------------------*/

/* Global variables to set the written text color */
static  __IO uint16_t TextColor = 0x0000, BackColor = 0xFFFF;

/* vars for timer dedicated for lcd backlight*/
static TIM_TimeBaseInitTypeDef      TIM_TimeBaseStructure;
static TIM_OCInitTypeDef            TIM_OCInitStructure;

s32                                 Current_CCR_BackLightStart = DEFAULT_CCR_BACKLIGHTSTART;

/* External variable ---------------------------------------------------------*/

s32                        CurrentRotateScreen        = +1;
Rotate_H12_V_Match_TypeDef CurrentScreenOrientation   = V12;

static u16 CharMagniCoeff = 1;                // !< Current character magnify coefficient.  
u8* CurrentFont = (u8*) &AsciiDotsTable;           /* pointer on the current font*/

/*! ASCII Table. Each character is 7 column (7 dots large) on two pages (16 dots high)
7 column character: Two 8 bit data to display one column*/
const u8 AsciiDotsTable[224 * 14] = {
    /* ASCII 32  */  0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 33  */  0x00,0x00,0x00,0x00,0x00,0x00,0x13,0xe0,0x00,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 34  */  0x00,0x00,0x00,0xe0,0x00,0x20,0x00,0x00,0x00,0xe0,0x00,0x20,0x00,0x00,
    /* ASCII 35  */  0x00,0x00,0x35,0x00,0x0f,0x80,0x35,0x60,0x0f,0x80,0x05,0x60,0x00,0x00,
    /* ASCII 36  */  0x00,0x00,0x0d,0x80,0x0a,0x40,0x3a,0x60,0x06,0x40,0x00,0x00,0x00,0x00,
    /* ASCII 37  */  0x00,0x00,0x02,0x40,0x02,0xa0,0x0a,0x40,0x15,0x00,0x09,0x00,0x00,0x00,
    /* ASCII 38  */  0x00,0x00,0x0c,0x00,0x13,0x00,0x14,0x80,0x08,0x80,0x14,0x00,0x00,0x00,
    /* ASCII 39  */  0x00,0x00,0x00,0x00,0x00,0x00,0x01,0xe0,0x00,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 40  */  0x00,0x00,0x00,0x00,0x00,0x00,0x1f,0x80,0x60,0x60,0x00,0x00,0x00,0x00,
    /* ASCII 41  */  0x00,0x00,0x00,0x00,0x60,0x60,0x1f,0x80,0x00,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 42  */  0x00,0x00,0x00,0x40,0x03,0x40,0x00,0xe0,0x03,0x40,0x00,0x40,0x00,0x00,
    /* ASCII 43  */  0x02,0x00,0x02,0x00,0x02,0x00,0x1f,0xc0,0x02,0x00,0x02,0x00,0x02,0x00,
    /* ASCII 44  */  0x00,0x00,0x00,0x00,0x60,0x00,0x38,0x00,0x08,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 45  */  0x00,0x00,0x02,0x00,0x02,0x00,0x02,0x00,0x02,0x00,0x02,0x00,0x00,0x00,
    /* ASCII 46  */  0x00,0x00,0x00,0x00,0x18,0x00,0x18,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 47  */  0x00,0x00,0x20,0x00,0x18,0x00,0x06,0x00,0x01,0x80,0x00,0x60,0x00,0x00,
    /* ASCII 48  */  0x00,0x00,0x0f,0xc0,0x10,0x20,0x10,0x20,0x10,0x20,0x0f,0xc0,0x00,0x00,
    /* ASCII 49  */  0x00,0x00,0x10,0x00,0x10,0x20,0x1f,0xe0,0x10,0x00,0x10,0x00,0x00,0x00,
    /* ASCII 50  */  0x00,0x00,0x18,0x40,0x14,0x20,0x12,0x20,0x11,0x20,0x18,0xc0,0x00,0x00,
    /* ASCII 51  */  0x00,0x00,0x08,0x40,0x10,0x20,0x11,0x20,0x11,0x20,0x0e,0xc0,0x00,0x00,
    /* ASCII 52  */  0x00,0x00,0x06,0x00,0x05,0x00,0x04,0xc0,0x14,0x20,0x1f,0xe0,0x14,0x00,
    /* ASCII 53  */  0x00,0x00,0x08,0x00,0x11,0xe0,0x11,0x20,0x11,0x20,0x0e,0x20,0x00,0x00,
    /* ASCII 54  */  0x00,0x00,0x0f,0x80,0x11,0x40,0x11,0x20,0x11,0x20,0x0e,0x20,0x00,0x00,
    /* ASCII 55  */  0x00,0x00,0x00,0x60,0x00,0x20,0x18,0x20,0x07,0x20,0x00,0xe0,0x00,0x00,
    /* ASCII 56  */  0x00,0x00,0x0e,0xc0,0x11,0x20,0x11,0x20,0x11,0x20,0x0e,0xc0,0x00,0x00,
    /* ASCII 57  */  0x00,0x00,0x11,0xc0,0x12,0x20,0x12,0x20,0x0a,0x20,0x07,0xc0,0x00,0x00,
    /* ASCII 58  */  0x00,0x00,0x00,0x00,0x19,0x80,0x19,0x80,0x00,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 59  */  0x00,0x00,0x00,0x00,0x30,0x00,0x19,0x80,0x09,0x80,0x00,0x00,0x00,0x00,
    /* ASCII 60  */  0x02,0x00,0x05,0x00,0x05,0x00,0x08,0x80,0x10,0x40,0x10,0x40,0x00,0x00,
    /* ASCII 61  */  0x00,0x00,0x05,0x00,0x05,0x00,0x05,0x00,0x05,0x00,0x05,0x00,0x00,0x00,
    /* ASCII 62  */  0x10,0x40,0x10,0x40,0x08,0x80,0x05,0x00,0x05,0x00,0x02,0x00,0x00,0x00,
    /* ASCII 63  */  0x00,0x00,0x00,0x00,0x10,0x80,0x14,0x40,0x02,0x40,0x01,0x80,0x00,0x00,
    /* ASCII 64  */  0x00,0x00,0x1f,0xe0,0x20,0x10,0x23,0x10,0x24,0x90,0x17,0xe0,0x00,0x00,
    /* ASCII 65  */  0x10,0x00,0x1c,0x00,0x17,0xa0,0x04,0x60,0x17,0x80,0x1c,0x00,0x10,0x00,
    /* ASCII 66  */  0x10,0x20,0x1f,0xe0,0x11,0x20,0x11,0x20,0x11,0x20,0x0e,0xc0,0x00,0x00,
    /* ASCII 67  */  0x00,0x00,0x0f,0xc0,0x10,0x20,0x10,0x20,0x10,0x20,0x08,0x60,0x00,0x00,
    /* ASCII 68  */  0x10,0x20,0x1f,0xe0,0x10,0x20,0x10,0x20,0x08,0x40,0x07,0x80,0x00,0x00,
    /* ASCII 69  */  0x10,0x20,0x1f,0xe0,0x11,0x20,0x13,0xa0,0x10,0x20,0x18,0x60,0x00,0x00,
    /* ASCII 70  */  0x00,0x00,0x10,0x20,0x1f,0xe0,0x11,0x20,0x03,0xa0,0x00,0x20,0x00,0x60,
    /* ASCII 71  */  0x00,0x00,0x0f,0xc0,0x10,0x20,0x10,0x20,0x12,0x20,0x0e,0x60,0x02,0x00,
    /* ASCII 72  */  0x10,0x20,0x1f,0xe0,0x11,0x20,0x01,0x00,0x11,0x20,0x1f,0xe0,0x10,0x20,
    /* ASCII 73  */  0x00,0x00,0x10,0x20,0x10,0x20,0x1f,0xe0,0x10,0x20,0x10,0x20,0x00,0x00,
    /* ASCII 74  */  0x00,0x00,0x0e,0x00,0x10,0x20,0x10,0x20,0x0f,0xe0,0x00,0x20,0x00,0x00,
    /* ASCII 75  */  0x10,0x20,0x1f,0xe0,0x12,0x20,0x03,0x00,0x04,0xa0,0x18,0x60,0x10,0x20,
    /* ASCII 76  */  0x00,0x00,0x10,0x20,0x1f,0xe0,0x10,0x20,0x10,0x00,0x1c,0x00,0x00,0x00,
    /* ASCII 77  */  0x10,0x20,0x1f,0xe0,0x10,0xe0,0x03,0x00,0x10,0xe0,0x1f,0xe0,0x10,0x20,
    /* ASCII 78  */  0x10,0x20,0x1f,0xe0,0x10,0xe0,0x07,0x00,0x18,0x20,0x1f,0xe0,0x00,0x20,
    /* ASCII 79  */  0x00,0x00,0x0f,0xc0,0x10,0x20,0x10,0x20,0x10,0x20,0x0f,0xc0,0x00,0x00,
    /* ASCII 80  */  0x00,0x00,0x10,0x20,0x1f,0xe0,0x12,0x20,0x02,0x20,0x01,0xc0,0x00,0x00,
    /* ASCII 81  */  0x00,0x00,0x0f,0xc0,0x10,0x20,0x30,0x20,0x30,0x20,0x2f,0xc0,0x00,0x00,
    /* ASCII 82  */  0x10,0x20,0x1f,0xe0,0x12,0x20,0x02,0x20,0x06,0x20,0x09,0xc0,0x10,0x00,
    /* ASCII 83  */  0x00,0x00,0x18,0xc0,0x09,0x20,0x11,0x20,0x11,0x40,0x0e,0x60,0x00,0x00,
    /* ASCII 84  */  0x00,0x60,0x00,0x20,0x10,0x20,0x1f,0xe0,0x10,0x20,0x00,0x20,0x00,0x60,
    /* ASCII 85  */  0x00,0x20,0x0f,0xe0,0x10,0x20,0x10,0x00,0x10,0x20,0x0f,0xe0,0x00,0x20,
    /* ASCII 86  */  0x00,0x20,0x00,0xe0,0x07,0x20,0x18,0x00,0x07,0x20,0x00,0xe0,0x00,0x20,
    /* ASCII 87  */  0x00,0x20,0x0f,0xe0,0x10,0x20,0x0f,0x00,0x10,0x20,0x0f,0xe0,0x00,0x20,
    /* ASCII 88  */  0x10,0x20,0x18,0x60,0x04,0x80,0x03,0x00,0x04,0x80,0x18,0x60,0x10,0x20,
    /* ASCII 89  */  0x00,0x20,0x00,0x60,0x11,0xa0,0x1e,0x00,0x11,0xa0,0x00,0x60,0x00,0x20,
    /* ASCII 90  */  0x00,0x00,0x18,0x60,0x14,0x20,0x13,0x20,0x10,0xa0,0x18,0x60,0x00,0x00,
    /* ASCII 91  */  0x00,0x00,0x00,0x00,0x7f,0xe0,0x40,0x20,0x40,0x20,0x00,0x00,0x00,0x00,
    /* ASCII 92  */  0x00,0x00,0x00,0x20,0x01,0xc0,0x06,0x00,0x38,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 93  */  0x00,0x00,0x00,0x00,0x40,0x20,0x40,0x20,0x7f,0xe0,0x00,0x00,0x00,0x00,
    /* ASCII 94  */  0x00,0x00,0x01,0x00,0x00,0x80,0x00,0x60,0x00,0x80,0x01,0x00,0x00,0x00,
    /* ASCII 95  */  0x80,0x00,0x80,0x00,0x80,0x00,0x80,0x00,0x80,0x00,0x80,0x00,0x80,0x00,
    /* ASCII 96  */  0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x20,0x00,0x40,0x00,0x00,0x00,0x00,
    /* ASCII 97  */  0x00,0x00,0x0d,0x00,0x12,0x80,0x12,0x80,0x12,0x80,0x1f,0x00,0x10,0x00,
    /* ASCII 98  */  0x10,0x20,0x1f,0xe0,0x11,0x00,0x10,0x80,0x10,0x80,0x0f,0x00,0x00,0x00,
    /* ASCII 99  */  0x00,0x00,0x0f,0x00,0x10,0x80,0x10,0x80,0x10,0x80,0x09,0x80,0x00,0x00,
    /* ASCII 100 */  0x00,0x00,0x0f,0x00,0x10,0x80,0x10,0x80,0x11,0x20,0x1f,0xe0,0x10,0x00,
    /* ASCII 101 */  0x00,0x00,0x0f,0x00,0x12,0x80,0x12,0x80,0x12,0x80,0x13,0x00,0x00,0x00,
    /* ASCII 102 */  0x00,0x00,0x10,0x80,0x1f,0xc0,0x10,0xa0,0x10,0xa0,0x10,0xa0,0x00,0x00,
    /* ASCII 103 */  0x00,0x00,0x0f,0x00,0x50,0x80,0x50,0x80,0x51,0x00,0x3f,0x80,0x00,0x80,
    /* ASCII 104 */  0x10,0x20,0x1f,0xe0,0x11,0x00,0x00,0x80,0x10,0x80,0x1f,0x00,0x10,0x00,
    /* ASCII 105 */  0x00,0x00,0x10,0x80,0x10,0x80,0x1f,0xa0,0x10,0x00,0x10,0x00,0x00,0x00,
    /* ASCII 106 */  0x00,0x00,0x40,0x80,0x40,0x80,0x40,0xa0,0x3f,0x80,0x00,0x00,0x00,0x00,
    /* ASCII 107 */  0x10,0x20,0x1f,0xe0,0x02,0x00,0x16,0x80,0x19,0x80,0x10,0x80,0x00,0x00,
    /* ASCII 108 */  0x00,0x00,0x10,0x00,0x10,0x20,0x1f,0xe0,0x10,0x00,0x10,0x00,0x00,0x00,
    /* ASCII 109 */  0x10,0x80,0x1f,0x80,0x10,0x80,0x1f,0x00,0x10,0x80,0x1f,0x00,0x10,0x00,
    /* ASCII 110 */  0x10,0x80,0x1f,0x80,0x11,0x00,0x00,0x80,0x10,0x80,0x1f,0x00,0x10,0x00,
    /* ASCII 111 */  0x00,0x00,0x0f,0x00,0x10,0x80,0x10,0x80,0x10,0x80,0x0f,0x00,0x00,0x00,
    /* ASCII 112 */  0x40,0x80,0x7f,0x80,0x51,0x00,0x10,0x80,0x10,0x80,0x0f,0x00,0x00,0x00,
    /* ASCII 113 */  0x00,0x00,0x0f,0x00,0x10,0x80,0x10,0x80,0x51,0x00,0x7f,0x80,0x40,0x80,
    /* ASCII 114 */  0x00,0x00,0x10,0x80,0x1f,0x80,0x11,0x00,0x10,0x80,0x10,0x80,0x00,0x00,
    /* ASCII 115 */  0x00,0x00,0x19,0x00,0x12,0x80,0x12,0x80,0x12,0x80,0x0d,0x80,0x00,0x00,
    /* ASCII 116 */  0x00,0x00,0x00,0x80,0x0f,0xc0,0x10,0x80,0x10,0x80,0x10,0x80,0x08,0x00,
    /* ASCII 117 */  0x00,0x80,0x0f,0x80,0x10,0x00,0x10,0x00,0x08,0x80,0x1f,0x80,0x10,0x00,
    /* ASCII 118 */  0x00,0x80,0x03,0x80,0x0c,0x80,0x10,0x00,0x0c,0x80,0x03,0x80,0x00,0x80,
    /* ASCII 119 */  0x00,0x80,0x0f,0x80,0x10,0x80,0x0e,0x00,0x10,0x80,0x0f,0x80,0x00,0x80,
    /* ASCII 120 */  0x10,0x80,0x19,0x80,0x06,0x00,0x06,0x00,0x19,0x80,0x10,0x80,0x00,0x00,
    /* ASCII 121 */  0x00,0x80,0x41,0x80,0x46,0x80,0x78,0x00,0x4c,0x80,0x03,0x80,0x00,0x80,
    /* ASCII 122 */  0x00,0x00,0x19,0x80,0x14,0x80,0x12,0x80,0x11,0x80,0x18,0x80,0x00,0x00,
    /* ASCII 123 */  0x00,0x00,0x00,0x00,0x04,0x00,0x3b,0xc0,0x40,0x20,0x00,0x00,0x00,0x00,
    /* ASCII 124 */  0x00,0x00,0x00,0x00,0x00,0x00,0x3f,0xe0,0x00,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 125 */  0x00,0x00,0x00,0x00,0x40,0x20,0x3b,0xc0,0x04,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 126 */  0x00,0x00,0x04,0x00,0x02,0x00,0x04,0x00,0x04,0x00,0x02,0x00,0x00,0x00,
    /* ASCII 127 */  0x00,0x00,0x03,0x80,0x02,0x40,0x02,0x20,0x02,0x40,0x03,0x80,0x00,0x00,
    /* ASCII 128 */  0x00,0x00,0x0F,0xC0,0x50,0x20,0x70,0x20,0x10,0x20,0x08,0x60,0x00,0x00,
    /* ASCII 129 */  0x00,0x80,0x0F,0xA0,0x10,0x00,0x10,0x00,0x08,0x80,0x1F,0xA0,0x10,0x00,
    /* ASCII 130 */  0x00,0x00,0x0F,0x00,0x12,0xA0,0x12,0x90,0x12,0x90,0x13,0x00,0x00,0x00,
    /* ASCII 131 */  0x00,0x00,0x0D,0x00,0x12,0xA0,0x12,0x90,0x12,0x90,0x1F,0x20,0x10,0x00,
    /* ASCII 132 */  0x00,0x00,0x0D,0x00,0x12,0xB0,0x12,0x80,0x12,0x80,0x1F,0x30,0x10,0x00,
    /* ASCII 133 */  0x00,0x00,0x0D,0x00,0x12,0x90,0x12,0x90,0x12,0xA0,0x1F,0x00,0x10,0x00,
    /* ASCII 134 */  0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 135 */  0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 136 */  0x00,0x00,0x0F,0x00,0x12,0xA0,0x12,0x90,0x12,0x90,0x13,0x20,0x00,0x00,
    /* ASCII 137 */  0x00,0x00,0x0F,0x00,0x12,0xB0,0x12,0x80,0x12,0x80,0x13,0x30,0x00,0x00,
    /* ASCII 138 */  0x00,0x00,0x0F,0x10,0x12,0x90,0x12,0xB0,0x12,0x80,0x13,0x00,0x00,0x00,
    /* ASCII 139 */  0x00,0x00,0x10,0x08,0x10,0x20,0x1F,0xE0,0x10,0x08,0x10,0x00,0x00,0x00,
    /* ASCII 140 */  0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 141 */  0x00,0x00,0x10,0x00,0x10,0x22,0x1F,0xE4,0x10,0x08,0x10,0x00,0x00,0x00,
    /* ASCII 142 */  0x10,0x00,0x1C,0x00,0x17,0x88,0x04,0x60,0x17,0x88,0x1C,0x00,0x10,0x00,
    /* ASCII 143 */  0x10,0x00,0x1C,0x00,0x17,0x84,0x04,0x6A,0x17,0x84,0x1C,0x00,0x10,0x00,
    /* ASCII 144 */  0x10,0x20,0x1F,0xE0,0x11,0x30,0x13,0xA8,0x10,0x24,0x18,0x60,0x00,0x00,
    /* ASCII 145 */  0x00,0x00,0x0D,0x00,0x15,0x00,0x1F,0x00,0x15,0x00,0x16,0x00,0x00,0x00,
    /* ASCII 146 */  0x00,0x00,0x1F,0x80,0x02,0x40,0x1F,0xC0,0x12,0x40,0x12,0x40,0x00,0x00,
    /* ASCII 147 */  0x00,0x00,0x0F,0x00,0x10,0xA0,0x10,0x90,0x10,0xA0,0x0F,0x00,0x00,0x00,
    /* ASCII 148 */  0x00,0x00,0x0F,0x00,0x10,0xA0,0x10,0x80,0x10,0xA0,0x0F,0x00,0x00,0x00,
    /* ASCII 149 */  0x00,0x00,0x0F,0x00,0x10,0x88,0x10,0x90,0x10,0xA0,0x0F,0x00,0x00,0x00,
    /* ASCII 150 */  0x00,0x80,0x0F,0x80,0x10,0x20,0x10,0x10,0x08,0xA0,0x1F,0x80,0x10,0x00,
    /* ASCII 151 */  0x00,0x80,0x0F,0x90,0x10,0x10,0x10,0x30,0x08,0x80,0x1F,0x80,0x10,0x00,
    /* ASCII 152 */  0x00,0x80,0x41,0x80,0x46,0xA0,0x78,0x00,0x4C,0xA0,0x03,0x80,0x00,0x80,
    /* ASCII 153 */  0x00,0x00,0x0F,0xC0,0x10,0x28,0x10,0x20,0x10,0x28,0x0F,0xC0,0x00,0x00,
    /* ASCII 154 */  0x00,0x20,0x0F,0xE8,0x10,0x20,0x10,0x00,0x10,0x20,0x0F,0xE8,0x00,0x20,
    /* ASCII 155 */  0x00,0x00,0x3F,0x00,0x18,0x80,0x16,0x80,0x11,0x80,0x0F,0xC0,0x00,0x00,
    /* ASCII 156 */  0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 157 */  0x00,0x00,0x3F,0xC0,0x1C,0x20,0x13,0x20,0x10,0xE0,0x0F,0xF0,0x00,0x00,
    /* ASCII 158 */  0x00,0x00,0x08,0x80,0x05,0x00,0x02,0x00,0x05,0x00,0x08,0x80,0x00,0x00,
    /* ASCII 159 */  0x00,0x00,0x20,0x00,0x42,0x00,0x3F,0xE0,0x02,0x10,0x00,0x20,0x00,0x00,
    /* ASCII 160 */  0x00,0x00,0x0D,0x00,0x12,0xA0,0x12,0x90,0x12,0x90,0x1F,0x00,0x10,0x00,
    /* ASCII 161 */  0x00,0x00,0x10,0x00,0x10,0x28,0x1F,0xE4,0x10,0x02,0x10,0x00,0x00,0x00,
    /* ASCII 162 */  0x00,0x00,0x0F,0x00,0x10,0xA0,0x10,0x90,0x10,0x88,0x0F,0x00,0x00,0x00,
    /* ASCII 163 */  0x00,0x20,0x0F,0xE0,0x10,0x28,0x10,0x04,0x10,0x22,0x0F,0xE0,0x00,0x20,
    /* ASCII 164 */  0x10,0x80,0x1F,0x80,0x11,0x20,0x00,0x90,0x10,0xA0,0x1F,0x10,0x10,0x00,
    /* ASCII 165 */  0x10,0x20,0x1F,0xE0,0x10,0xE8,0x07,0x04,0x18,0x28,0x1F,0xE4,0x00,0x20,
    /* ASCII 166 */  0x00,0x00,0x13,0x40,0x14,0xA0,0x14,0xA0,0x14,0xA0,0x17,0xC0,0x14,0x00,
    /* ASCII 167 */  0x00,0x00,0x13,0xC0,0x14,0x20,0x14,0x20,0x14,0x20,0x13,0xC0,0x00,0x00,
    /* ASCII 168 */  0x00,0x00,0x0C,0x00,0x12,0x00,0x11,0x40,0x08,0x40,0x00,0x00,0x00,0x00,
    /* ASCII 169 */  0x0F,0xC0,0x10,0x20,0x17,0x20,0x12,0xA0,0x15,0x20,0x10,0x20,0x0F,0xC0,
    /* ASCII 170 */  0x00,0x08,0x00,0x08,0x00,0x08,0x00,0x08,0x00,0x08,0x00,0x18,0x00,0x00,
    /* ASCII 171 */  0x00,0x00,0x05,0xC0,0x02,0x00,0x13,0x00,0x1A,0x80,0x14,0x00,0x00,0x00,
    /* ASCII 172 */  0x00,0x00,0x05,0xC0,0x02,0x00,0x0D,0x00,0x0A,0x80,0x1E,0x00,0x08,0x00,
    /* ASCII 173 */  0x00,0x00,0x0C,0x00,0x1F,0x40,0x0C,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 174 */  0x00,0x00,0x04,0x00,0x0A,0x00,0x00,0x00,0x04,0x00,0x0A,0x00,0x00,0x00,
    /* ASCII 175 */  0x00,0x00,0x0A,0x00,0x04,0x00,0x00,0x00,0x0A,0x00,0x04,0x00,0x00,0x00,
    /* ASCII 176 */  0x08,0x80,0x02,0x20,0x08,0x80,0x02,0x20,0x08,0x80,0x02,0x20,0x00,0x00,
    /* ASCII 177 */  0x15,0x40,0x0A,0xA0,0x15,0x40,0x0A,0xA0,0x15,0x40,0x0A,0xA0,0x00,0x00,
    /* ASCII 178 */  0x17,0x60,0x1D,0xC0,0x17,0x60,0x1D,0xC0,0x17,0x60,0x1D,0xC0,0x00,0x00,
    /* ASCII 179 */  0x00,0x00,0x00,0x00,0x00,0x00,0x1F,0xE0,0x00,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 180 */  0x01,0x00,0x01,0x00,0x01,0x00,0x1F,0xE0,0x00,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 181 */  0x10,0x00,0x1C,0x00,0x17,0x90,0x04,0x68,0x17,0x84,0x1C,0x00,0x10,0x00,
    /* ASCII 182 */  0x10,0x00,0x1C,0x10,0x17,0x88,0x04,0x64,0x17,0x88,0x1C,0x10,0x10,0x00,
    /* ASCII 183 */  0x10,0x00,0x1C,0x00,0x17,0x84,0x04,0x68,0x17,0x90,0x1C,0x00,0x10,0x00,
    /* ASCII 184 */  0x0F,0xC0,0x10,0x20,0x17,0xA0,0x14,0xA0,0x14,0xA0,0x10,0x20,0x0F,0xC0,
    /* ASCII 185 */  0x02,0x80,0x02,0x80,0xFE,0xFF,0x00,0x00,0xFF,0xFF,0x00,0x00,0x00,0x00,
    /* ASCII 186 */  0x00,0x00,0x00,0x00,0xFF,0xFF,0x00,0x00,0xFF,0xFF,0x00,0x00,0x00,0x00,
    /* ASCII 187 */  0x02,0x80,0x02,0x80,0xFE,0x80,0x00,0x80,0xFF,0x80,0x00,0x00,0x00,0x00,
    /* ASCII 188 */  0x02,0x80,0x02,0x80,0x02,0xFF,0x02,0x00,0x03,0xFF,0x00,0x00,0x00,0x00,
    /* ASCII 189 */  0x00,0x00,0x06,0x00,0x09,0x00,0x19,0x80,0x09,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 190 */  0x00,0x00,0x0A,0x60,0x0A,0x80,0x1F,0x00,0x0A,0x80,0x0A,0x60,0x00,0x00,
    /* ASCII 191 */  0x01,0x00,0x01,0x00,0x01,0x00,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 192 */  0x00,0x00,0x00,0x00,0x00,0x00,0x01,0xFF,0x01,0x00,0x01,0x00,0x01,0x00,
    /* ASCII 193 */  0x01,0x00,0x01,0x00,0x01,0x00,0x01,0xFF,0x01,0x00,0x01,0x00,0x01,0x00,
    /* ASCII 194 */  0x01,0x00,0x01,0x00,0x01,0x00,0xFF,0x00,0x01,0x00,0x01,0x00,0x01,0x00,
    /* ASCII 195 */  0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0x01,0x00,0x01,0x00,0x01,0x00,
    /* ASCII 196 */  0x01,0x00,0x01,0x00,0x01,0x00,0x01,0x00,0x01,0x00,0x01,0x00,0x01,0x00,
    /* ASCII 197 */  0x01,0x00,0x01,0x00,0x01,0x00,0xFF,0xFF,0x01,0x00,0x01,0x00,0x01,0x00,
    /* ASCII 198 */  0x00,0x00,0x0D,0x20,0x12,0x90,0x12,0xA0,0x12,0x90,0x1F,0x00,0x10,0x00,
    /* ASCII 199 */  0x10,0x00,0x1C,0x00,0x17,0x88,0x04,0x64,0x17,0x88,0x1C,0x04,0x10,0x00,
    /* ASCII 200 */  0x00,0x00,0x00,0x00,0x03,0xFF,0x02,0x00,0x02,0xFF,0x02,0x80,0x02,0x80,
    /* ASCII 201 */  0x00,0x00,0x00,0x00,0xFF,0x80,0x00,0x80,0xFE,0x80,0x02,0x80,0x02,0x80,
    /* ASCII 202 */  0x02,0x80,0x02,0x80,0x02,0xFF,0x02,0x00,0x02,0xFF,0x02,0x80,0x02,0x80,
    /* ASCII 203 */  0x02,0x80,0x02,0x80,0xFE,0x80,0x00,0x80,0xFE,0x80,0x02,0x80,0x02,0x80,
    /* ASCII 204 */  0x00,0x00,0x00,0x00,0xFF,0xFF,0x00,0x00,0xFE,0xFF,0x02,0x80,0x02,0x80,
    /* ASCII 205 */  0x02,0x80,0x02,0x80,0x02,0x80,0x02,0x80,0x02,0x80,0x02,0x80,0x02,0x80,
    /* ASCII 206 */  0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 207 */  0x17,0xA0,0x08,0x40,0x08,0x40,0x08,0x40,0x08,0x40,0x17,0xA0,0x00,0x00,
    /* ASCII 208 */  0x00,0x00,0x08,0x80,0x15,0x40,0x16,0x40,0x0C,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 209 */  0x11,0x20,0x1F,0xE0,0x11,0x20,0x10,0x20,0x08,0x40,0x07,0x80,0x00,0x00,
    /* ASCII 210 */  0x10,0x20,0x1F,0xE0,0x11,0x30,0x13,0xA8,0x10,0x30,0x18,0x60,0x00,0x00,
    /* ASCII 211 */  0x10,0x20,0x1F,0xE0,0x11,0x28,0x13,0xA0,0x10,0x28,0x18,0x60,0x00,0x00,
    /* ASCII 212 */  0x10,0x20,0x1F,0xE0,0x11,0x24,0x13,0xA8,0x10,0x30,0x18,0x60,0x00,0x00,
    /* ASCII 213 */  0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x1C,0x00,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 214 */  0x00,0x00,0x10,0x20,0x10,0x20,0x1F,0xF0,0x10,0x28,0x10,0x24,0x00,0x00,
    /* ASCII 215 */  0x00,0x00,0x10,0x30,0x10,0x28,0x1F,0xE4,0x10,0x28,0x10,0x30,0x00,0x00,
    /* ASCII 216 */  0x00,0x00,0x10,0x20,0x10,0x28,0x1F,0xE0,0x10,0x28,0x10,0x20,0x00,0x00,
    /* ASCII 217 */  0x01,0x00,0x01,0x00,0x01,0x00,0x01,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 218 */  0x00,0x00,0x00,0x00,0x00,0x00,0x3F,0x00,0x01,0x00,0x01,0x00,0x01,0x00,
    /* ASCII 219 */  0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,
    /* ASCII 220 */  0xFF,0x00,0xFF,0x00,0xFF,0x00,0xFF,0x00,0xFF,0x00,0xFF,0x00,0xFF,0x00,
    /* ASCII 221 */  0x00,0x00,0x00,0x00,0x00,0x00,0x7F,0x3F,0x00,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 222 */  0x00,0x00,0x10,0x24,0x10,0x28,0x1F,0xF0,0x10,0x20,0x10,0x20,0x00,0x00,
    /* ASCII 223 */  0x00,0xFF,0x00,0xFF,0x00,0xFF,0x00,0xFF,0x00,0xFF,0x00,0xFF,0x00,0xFF,
    /* ASCII 224 */  0x00,0x00,0x0F,0xC0,0x10,0x20,0x10,0x30,0x10,0x28,0x0F,0xC0,0x00,0x00,
    /* ASCII 225 */  0x00,0x00,0x7F,0xE0,0x11,0x20,0x11,0x20,0x11,0x20,0x0E,0xC0,0x00,0x00,
    /* ASCII 226 */  0x00,0x00,0x0F,0xC0,0x10,0x28,0x10,0x24,0x10,0x28,0x0F,0xC0,0x00,0x00,
    /* ASCII 227 */  0x00,0x00,0x0F,0xC0,0x10,0x28,0x10,0x30,0x10,0x20,0x0F,0xC0,0x00,0x00,
    /* ASCII 228 */  0x00,0x00,0x0F,0x00,0x10,0xA0,0x10,0x90,0x10,0xA0,0x0F,0x10,0x00,0x00,
    /* ASCII 229 */  0x00,0x00,0x0F,0xC0,0x10,0x28,0x10,0x24,0x10,0x28,0x0F,0xC4,0x00,0x00,
    /* ASCII 230 */  0x40,0x80,0x3F,0x80,0x10,0x00,0x10,0x00,0x08,0x80,0x1F,0x80,0x10,0x00,
    /* ASCII 231 */  0x00,0x00,0x1F,0xC0,0x15,0x40,0x05,0x00,0x02,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 232 */  0x00,0x00,0x1F,0xE0,0x14,0xA0,0x04,0x80,0x03,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 233 */  0x00,0x20,0x0F,0xE0,0x10,0x20,0x10,0x0C,0x10,0x24,0x0F,0xE4,0x00,0x20,
    /* ASCII 234 */  0x00,0x20,0x0F,0xE0,0x10,0x28,0x10,0x04,0x10,0x28,0x0F,0xE0,0x00,0x20,
    /* ASCII 235 */  0x00,0x20,0x0F,0xE4,0x10,0x24,0x10,0x0C,0x10,0x20,0x0F,0xE0,0x00,0x20,
    /* ASCII 236 */  0x00,0x80,0x41,0x80,0x46,0xA0,0x78,0x10,0x4C,0x88,0x03,0x80,0x00,0x80,
    /* ASCII 237 */  0x00,0x20,0x00,0x60,0x11,0xA0,0x1E,0x10,0x11,0xA8,0x00,0x64,0x00,0x20,
    /* ASCII 228 */  0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 239 */  0x00,0x00,0x00,0x04,0x00,0x03,0x00,0x01,0x00,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 240 */  0x00,0x00,0x02,0x00,0x02,0x00,0x02,0x00,0x02,0x00,0x02,0x00,0x00,0x00,
    /* ASCII 241 */  0x00,0x00,0x11,0x00,0x11,0x00,0x17,0xC0,0x11,0x00,0x11,0x00,0x00,0x00,
    /* ASCII 242 */  0xA0,0x00,0xA0,0x00,0xA0,0x00,0xA0,0x00,0xA0,0x00,0xA0,0x00,0xA0,0x00,
    /* ASCII 243 */  0x02,0x20,0x06,0xA0,0x03,0xE0,0x0D,0x00,0x0A,0x80,0x1E,0x00,0x08,0x00,
    /* ASCII 244 */  0x00,0x00,0x00,0xC0,0x01,0x20,0x1F,0xE0,0x00,0x20,0x1F,0xE0,0x00,0x00,
    /* ASCII 245 */  0x00,0x00,0x0C,0x38,0x10,0xC4,0x11,0x44,0x11,0x84,0x0E,0x18,0x00,0x00,
    /* ASCII 246 */  0x00,0x00,0x02,0x00,0x02,0x00,0x0A,0x80,0x02,0x00,0x02,0x00,0x00,0x00,
    /* ASCII 247 */  0x00,0x00,0x80,0x00,0x60,0x00,0x20,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 248 */  0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x20,0x00,0x50,0x00,0x20,0x00,0x00,
    /* ASCII 249 */  0x00,0x00,0x00,0x00,0x00,0x01,0x00,0x00,0x00,0x01,0x00,0x00,0x00,0x00,
    /* ASCII 250 */  0x00,0x00,0x00,0x00,0x04,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 251 */  0x00,0x00,0x01,0xC0,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 252 */  0x00,0x00,0x02,0xA0,0x03,0xE0,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 253 */  0x00,0x00,0x02,0x40,0x03,0x20,0x02,0xC0,0x00,0x00,0x00,0x00,0x00,0x00,
    /* ASCII 254 */  0x00,0x00,0x0F,0x80,0x0F,0x80,0x0F,0x80,0x0F,0x80,0x0F,0x80,0x00,0x00,
    /* ASCII 255 */  0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00};

    static s32 CharFilter_XMin = 0;         /*restricted area when painting characters*/
    static s32 CharFilter_XMax = 160;       /*restricted area when painting characters*/
    static s32 CharFilter_YMin = 0;         /*restricted area when painting characters*/
    static s32 CharFilter_YMax = 128;       /*restricted area when painting characters*/

