satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Utilities/STM32_EVAL/STM32_PRIMER2/stm32_primer2_lcd.c
    const s32 OrientationOffsetX [] = { +0   /* V12*/,  0    /* V3*/,    0/* V6*/,  +32   /* V9*/ , +0 /*V12 at reset */};
    const s32 OrientationOffsetY [] = { 0    /* V12*/,  0    /* V3*/,+32  /* V6*/,  0     /* V9*/ , +0 /*V12 at reset */};

    /* Private function prototypes -----------------------------------------------*/

    void LCD_FSMC_Init(void);   /* Important */
    static void LCD_ST7732S_Controller_init( void );
    static void LCD_BackLightChange( void );
    static void LCD_BackLightConfig( void );
    static void LCD_CtrlLinesWrite( GPIO_TypeDef* GPIOx, u32 CtrlPins, BitAction BitVal );

    /* Private functions ---------------------------------------------------------*/
    /*******************************************************************************
    *
    *                                LCD_CheckLCDStatus
    *
    *******************************************************************************/
    /**
    *  Check whether LCD LCD is busy or not.
    *
    **/
    /******************************************************************************/
    static void LCD_CheckLCDStatus( void )
        {
        /* send command RDDID*/
        LCD_SendLCDCmd(ST7732_RDDID);
        /* Read LCD device IDs*/
        LCD_ReadLCDData();
        LCD_ReadLCDData();
        LCD_ReadLCDData();
        }

    /*******************************************************************************
    *
    *                                LCD_DisplayRotate
    *
    *******************************************************************************/
    /**
    *  Configure the LCD controller for a given orientation.
    *
    *  @param[in]  H12 The new screen orientation.
    *
    **/
    /******************************************************************************/
    static void LCD_DisplayRotate( Rotate_H12_V_Match_TypeDef H12 )
        {
        /* Memory Access Control 0x36*/
        LCD_SendLCDCmd( ST7732_MADCTR );

        switch( H12 )
            {
            case V3  :
                LCD_SendLCDData( V3_MADCTRVAL );
                break;

            case V6  :
                LCD_SendLCDData( V6_MADCTRVAL );
                break;

            case V9  :
                LCD_SendLCDData( V9_MADCTRVAL );
                break;

            case V12 :
            default  :
                LCD_SendLCDData( V12_MADCTRVAL );
                break;
            }
        }

    void delayms(s32 count) 
        {
            vu32 index = 0; 
            for(index = (10000 * count); index != 0; index--)
            {
            }
        }

    /*******************************************************************************
    *
    *                                LCD_ST7732S_Controller_init
    *
    *******************************************************************************/
    /**
    *  Initialization of the controller registers.
    *
    **/
    /******************************************************************************/
        void LCD_ST7732S_Controller_init( void )				
        {
        s32 i;

#define WriteCOM LCD_SendLCDCmd
#define WriteData LCD_SendLCDData

#define WRITE_LCD(addr,val)   { WriteCOM(val); }

        delayms(100);
        GPIO_WriteBit( GPIOD, CtrlPin_RST, Bit_RESET ); /* RST = 0  */
        delayms(100);
        GPIO_WriteBit( GPIOD, CtrlPin_RST, Bit_SET );   /* RST = 1  */
        delayms(100);

        WriteCOM(ST7732_SWRESET);          /*Software Reset*/
        delayms(180);                      /*DELAY 150MS*/

        WriteCOM(ST7732_SLPIN);                    /*sleep IN*/
        delayms(100);
        WriteCOM(ST7732_SLPOUT);                    /*sleep out*/
        delayms(150);

        /* WriteCOM(0xc5);                   //VCOM Control 1*/
        /* WriteData(40);                    //set vcomh=4.475V*/
        /* WriteData(45);                    //SET VCOML=-0.800V*/

        WriteCOM(ST7732_FRMCTR1);          /*	 frame*/
        WriteData(0x06);
        WriteData(0x03);
        WriteData(0x02);  
        //delayms(10);

        WriteCOM(ST7732_INVCTR);           /*	0xb4*/
        WriteData(0x03);

        WriteCOM(ST7732_DISSET5);          /*  frame 0xB6*/
        WriteData(0x02);
        WriteData(0x0e);

        WriteCOM(ST7732_DISPCTRL);         /* 0xF5*/
        WriteData(0x1a);

        WriteCOM(0xc0);                    /*Power Control 1 ( gvdd vci1)*/
        WriteData(0x02);
        WriteData(0x00);

        WriteCOM(0xc1);                    /*Power Control 2( avdd vcl vgh vgl)	*/
        WriteData(0x05);

        WriteCOM(0xc2);                    /*Power Control 3 ( in normal)   */
        WriteData(0x02);
        WriteData(0x02);

        WriteCOM(0xc3);                    /*Power Control 4 ( in Idle mode)   */
        WriteData(0x01);
        WriteData(0x02);

        WriteCOM(0xc4);                    /*Power Control 5 ( in partial mode)  */
        WriteData(0x01);
        WriteData(0x02);

        WriteCOM(0xc5);                    /*Vcom Control ( vcomh,voml)  */
        WriteData(0x47);
        WriteData(0x3a);

        WriteCOM(ST7732_OSCADJ);           /* 0xF2 intern OSC 80Hz*/
        WriteData(0x02);

        WriteCOM(ST7732_DEFADJ);           /*0xF6*/
        WriteData(0x4c);

        WriteCOM(0xf8);   /*cmd 0xf8,dat 0x06; LOAD */
        WriteData(0x06);  /*SLEEP OUT LOAD DEFAULT*/


        /****************gamma adjust **********************/
        WriteCOM(0xe0);    		           /*gamma*/
        WriteData(0x06);
        WriteData(0x1c);
        WriteData(0x1f);
        WriteData(0x1f);
        WriteData(0x18);
        WriteData(0x13);
        WriteData(0x06);
        WriteData(0x03);
        WriteData(0x03);
        WriteData(0x04);
        WriteData(0x07);
        WriteData(0x07);
        WriteData(0x00);

        WriteCOM(0xe1);    		           /*gamma*/
        WriteData(0x0a);
        WriteData(0x14);
        WriteData(0x1b);
        WriteData(0x18);
        WriteData(0x12);
        WriteData(0x0e);
        WriteData(0x02);
        WriteData(0x01);
        WriteData(0x00);
        WriteData(0x01);
        WriteData(0x08);
        WriteData(0x07);
        WriteData(0x00);

