satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Utilities/STM32_EVAL/STM32_PRIMER2/stm32_primer2_lcd.c
        WriteCOM(ST7732_MADCTR);           /* Memory Access Control 0x36  */
        WriteData(V12_MADCTRVAL);

        WriteCOM(0x2a);    	               /*Column Range*/
        WriteData(0x00);
        WriteData(0x00);
        WriteData(0x00);
        WriteData(0x7F);

        WriteCOM(0x2b);    	               /*page Range*/
        WriteData(0x00);
        WriteData(0x00);
        WriteData(0x00);
        WriteData(0x7F);                   /* configured as 128x128*/

        WriteCOM(ST7732_COLMOD);           /* Color mode = 65k 0x3A*/
        WriteData(0x55);

        WriteCOM(ST7732_TEON);             /* 0x35*/
        WriteData(0x00);

        WriteCOM(0x29);                     /*display on*/
        delayms(20);

        /*LCD_FillRect ( 0,0,161,131, RGB_WHITE );*/
        LCD_FillRect_Circle ( 0,0,131,161, LCD_COLOR_WHITE );
        }

    /*******************************************************************************
    *
    *                                LCD_BackLightConfig
    *
    *******************************************************************************/
    /**
    *  Setting of the PWM that drives the backlight intensity.
    *
    **/
    /******************************************************************************/
void LCD_BackLightConfig( void )
        {
        GPIO_InitTypeDef GPIO_InitStructure;

        /* Enable GPIOB clock  */
        RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOB, ENABLE );

        /* GPIOB Configuration:TIM4 2 in Output */
        GPIO_InitStructure.GPIO_Pin   = GPIO_BACKLIGHT_PIN;

        GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;
        GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;

        GPIO_Init( GPIOB, &GPIO_InitStructure );


        /* TIM4 Configuration -----------------------------------------------------*/
        /* TIM4CLK = 12 MHz, Prescaler = 0x0 */

        /* Enable TIM4 clock */
        RCC_APB1PeriphClockCmd( RCC_APB1Periph_TIM4, ENABLE );

        TIM_DeInit( TIM4 );
        TIM_TimeBaseStructInit( &TIM_TimeBaseStructure );
        TIM_OCStructInit( &TIM_OCInitStructure );

        /* Time base configuration */
        TIM_TimeBaseStructure.TIM_Period          = 0xFFFF;
        TIM_TimeBaseStructure.TIM_Prescaler       = 0x00;
        TIM_TimeBaseStructure.TIM_ClockDivision   = 0x0;
        TIM_TimeBaseStructure.TIM_CounterMode     = TIM_CounterMode_Up;

        TIM_TimeBaseInit( TIM4, &TIM_TimeBaseStructure );

        /* Output Compare Toggle Mode configuration: Channel2 */
        TIM_OCInitStructure.TIM_OCMode      = TIM_OCMode_PWM1;
        //TIM_OCInitStructure.TIM_Channel     = TIM_Channel_2;			 /* FWLib v2.0 : replaced with next line*/
        TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;   /* FWLib v2.0*/
        TIM_OCInitStructure.TIM_Pulse       = Current_CCR_BackLightStart;

        TIM_OC3Init( TIM4, &TIM_OCInitStructure );
        TIM_OC3PreloadConfig( TIM4, TIM_OCPreload_Disable );

        TIM_ARRPreloadConfig( TIM4, ENABLE );

        /* Enable TIM4 IT */
        /*TIM_ITConfig( TIM4, TIMER_IT_CHANN, ENABLE );*/

        /* Go !!!*/
        TIM_Cmd( TIM4, ENABLE );
        }

    /*******************************************************************************
    *
    *                                LCD_BackLightChange
    *
    *******************************************************************************/
    /**
    *  Modify the PWM rate.
    *
    **/
    /******************************************************************************/
    static void LCD_BackLightChange( void )
        {
        /* Output Compare Toggle Mode configuration: Channel2 */
        TIM_OCInitStructure.TIM_Pulse = Current_CCR_BackLightStart;

        TIM_OC3Init( TIM4, &TIM_OCInitStructure );
        }

    /* Public functions for CircleOS ---------------------------------------------*/

    /*******************************************************************************
    *
    *                                LCD_Init
    *
    *******************************************************************************/
    /**
    *
    *  Initialize LCD. Called at CircleOS startup.
    *
    *  @attention  This function must <b>NOT</b> be called by the user.
    *
    **/
    /******************************************************************************/
    void LCD_Init( void )
        {
        LCD_SetBackLight( Current_CCR_BackLightStart );

        /* Do some gpio configs*/
        GPIO_InitTypeDef GPIO_InitStructure;

        /* Enable GPIO clock for LCD */
        RCC_APB2PeriphClockCmd( GPIO_LCD_CTRL_PERIPH, ENABLE );
        RCC_APB2PeriphClockCmd( GPIO_LCD_D_PERIPH, ENABLE );
        RCC_APB2PeriphClockCmd( GPIO_LCD_CS_PERIPH, ENABLE );

        /* Enable GPIOC clock */
        RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOC, ENABLE );

        /* Init BackLight*/
        LCD_BackLightConfig();

        /* LCD Init */

        /* Enable the FSMC Clock */
        RCC_AHBPeriphClockCmd(RCC_AHBPeriph_FSMC, ENABLE);

        /* Configure FSMC Bank1 NOR/SRAM3 */
        LCD_FSMC_Init();

        LCD_ST7732S_Controller_init();
        }

    /*******************************************************************************
    *
    *                                LCD_FSMC_Init
    *
    *******************************************************************************/
    /**
    *
    *  @attention  This function must <b>NOT</b> be called by the user.
    *
    **/
    /******************************************************************************/
    void LCD_FSMC_Init( void )
        {
        FSMC_NORSRAMInitTypeDef  FSMC_NORSRAMInitStructure;
        FSMC_NORSRAMTimingInitTypeDef  p;
        GPIO_InitTypeDef GPIO_InitStructure; 

        RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD | GPIO_LCD_D_PERIPH, ENABLE);


        /*-- GPIO Configuration ------------------------------------------------------*/
        /* SRAM Data lines configuration */

        GPIO_InitStructure.GPIO_Pin = LCD_DATA_PINS;
        GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
        GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
        GPIO_Init(GPIOx_D_LCD, &GPIO_InitStructure); 

        /* NOE, NWE and NE1 configuration */  
        GPIO_InitStructure.GPIO_Pin = CtrlPin_RD | CtrlPin_WR | CtrlPin_RS;
        GPIO_Init(GPIOx_CTRL_LCD, &GPIO_InitStructure);

        /* Reset : configured as regular GPIO, is not FSMC-controlled */
        GPIO_InitStructure.GPIO_Pin = CtrlPin_RST | CtrlPin_CS;
        GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
        GPIO_Init(GPIOD, &GPIO_InitStructure); 

        GPIO_WriteBit( GPIOD, CtrlPin_RST, Bit_SET ); /*reset active at LOW*/
        GPIO_WriteBit( GPIOD, CtrlPin_CS, Bit_RESET ); /*reset active at LOW*/


        /*-- FSMC Configuration ------------------------------------------------------*/
        p.FSMC_AddressSetupTime = 2;
        p.FSMC_AddressHoldTime = 2;
        p.FSMC_DataSetupTime = 2;
        p.FSMC_BusTurnAroundDuration = 5;
        p.FSMC_CLKDivision = 5;
        p.FSMC_DataLatency = 5;
        p.FSMC_AccessMode = FSMC_AccessMode_A;

