satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Utilities/STM32_EVAL/STM32_PRIMER2/stm32_primer2_lcd.c
        FSMC_NORSRAMInitStructure.FSMC_Bank = FSMC_Bank1_NORSRAM3;
        FSMC_NORSRAMInitStructure.FSMC_DataAddressMux = FSMC_DataAddressMux_Disable;
        FSMC_NORSRAMInitStructure.FSMC_MemoryType = FSMC_MemoryType_SRAM;
        FSMC_NORSRAMInitStructure.FSMC_MemoryDataWidth = FSMC_MemoryDataWidth_16b;        /* changed from 16b*/
        FSMC_NORSRAMInitStructure.FSMC_BurstAccessMode = FSMC_BurstAccessMode_Disable;
        FSMC_NORSRAMInitStructure.FSMC_AsynchronousWait = FSMC_AsynchronousWait_Disable;  
        FSMC_NORSRAMInitStructure.FSMC_WaitSignalPolarity = FSMC_WaitSignalPolarity_Low;  /* cf RM p363 + p384*/
        FSMC_NORSRAMInitStructure.FSMC_WrapMode = FSMC_WrapMode_Disable;
        FSMC_NORSRAMInitStructure.FSMC_WaitSignalActive = FSMC_WaitSignalActive_BeforeWaitState;
        FSMC_NORSRAMInitStructure.FSMC_WriteOperation = FSMC_WriteOperation_Enable;
        FSMC_NORSRAMInitStructure.FSMC_WaitSignal = FSMC_WaitSignal_Disable;
        FSMC_NORSRAMInitStructure.FSMC_ExtendedMode = FSMC_ExtendedMode_Disable;
        FSMC_NORSRAMInitStructure.FSMC_WriteBurst = FSMC_WriteBurst_Disable;
        FSMC_NORSRAMInitStructure.FSMC_ReadWriteTimingStruct = &p;
        FSMC_NORSRAMInitStructure.FSMC_WriteTimingStruct = &p;

        FSMC_NORSRAMInit(&FSMC_NORSRAMInitStructure); 

        /* Enable FSMC Bank1_SRAM Bank */
        FSMC_NORSRAMCmd(FSMC_Bank1_NORSRAM3, ENABLE);  
        }

    /*******************************************************************************
    *
    *                                LCD_FillRect_Circle
    *
    *******************************************************************************/
    /**
    *
    *  Fill a rectangle with a provided color.
    *
    *  @param[in]  x        The horizontal coordinate of the rectangle low left corner.
    *  @param[in]  y        The vertical coordinate of the rectangle low left corner.
    *  @param[in]  width    The rectangle width in pixels.
    *  @param[in]  height   The rectangle height in pixels.
    *  @param[in]  color    The RGB color to fill the rectangle with.
    *
    *  @warning    The (0x0) point in on the low left corner.
    *
    *  Rq : this function does not check parameters validity 
    *
    **/
    /******************************************************************************/
        void LCD_FillRect_Circle( u16 x, u16 y, u16 width, u16 height, u16 color )
            {
            u8 Line;
            u8 Column;

            /* Select LCD screen area. */
            LCD_SetRect_For_Cmd( x, y, width, height );

            /* Send LCD RAM write command. */
            LCD_SendLCDCmd( ST7732_RAMWR );

            /* Fill selected LCD screen area with provided color. */
            for( Line = 0; Line < width; Line++ )
                {
                for( Column = 0; Column < height; Column++ )
                    {
                    LCD_SendLCDData( ( color >> 8 ) & 0xff );
                    LCD_SendLCDData( color & 0xff );
                    }
                }

            }

        // /*******************************************************************************
        // *
        // *                                LCD_FillRect
        // *
        // *******************************************************************************/
        // /**
        // *
        // *  Fill a rectangle with a provided color.
        // *
        // *  @param[in]  x        The horizontal coordinate of the rectangle low left corner.
        // *  @param[in]  y        The vertical coordinate of the rectangle low left corner.
        // *  @param[in]  width    The rectangle width in pixels.
        // *  @param[in]  height   The rectangle height in pixels.
        // *  @param[in]  color    The RGB color to fill the rectangle with.
        // *
        // *  @warning    The (0x0) point in on the low left corner.
        // *
        // **/
        // /******************************************************************************/
        // void LCD_FillRect( u16 x, u16 y, u16 width, u16 height, u16 color )
            // {
     
            // /* Rq : this fuction is just a wrapper with parameter limit checks*/
            
            // /* Check the x parameters*/
            // if (x < 0)
                // x = 0;
            // if (x > SCREEN_WIDTH)
                // x = SCREEN_WIDTH;
            // if ( (x + width) > SCREEN_WIDTH )
                // width = SCREEN_WIDTH - x;
            
            // /* Check the y parameters*/
            // if (y < 0)
                // y = 0;
            // if (y > SCREEN_HEIGHT)
                // y = SCREEN_HEIGHT;
            // if ( (y + height) > SCREEN_HEIGHT )
                // height = SCREEN_HEIGHT - y;

            // /* Call the native function*/
            // LCD_FillRect_Circle( x, y, width, height, color );
            // }

        /*******************************************************************************
        *
        *                                LCD_DrawRect_Circle
        *
        *******************************************************************************/
        /**
        *
        *  Draw a rectangle with a provided color.
        *
        *  @param[in]  x        The horizontal coordinate of the rectangle low left corner.
        *  @param[in]  y        The vertical coordinate of the rectangle low left corner.
        *  @param[in]  width    The rectangle width in pixels.
        *  @param[in]  height   The rectangle height in pixels.
        *  @param[in]  color    The RGB color to draw the rectangle with.
        *
        *  @warning    The (0x0) point in on the low left corner.
        *
        **/
        /******************************************************************************/
        void LCD_DrawRect_Circle( u16 x, u16 y, u16 width, u16 height, u16 color )
            {
            // /* Draw horizontal sides.*/
            // LCD_FillRect( x, y,              width, 1, color );
            // LCD_FillRect( x, y + height - 1, width, 1, color );

            // /* Draw vertical sides.*/
            // LCD_FillRect( x,              y, 1, height, color );
            // LCD_FillRect( x + width - 1,  y, 1, height, color );
            
            /* Draw horizontal sides.*/
            LCD_FillRect_Circle( x, y,              width, 1, color );
            LCD_FillRect_Circle( x, y + height - 1, width, 1, color );

            /* Draw vertical sides.*/
            LCD_FillRect_Circle( x,              y, 1, height, color );
            LCD_FillRect_Circle( x + width - 1,  y, 1, height, color );
            }
        
