satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Utilities/STM32_EVAL/STM32_PRIMER2/stm32_primer2_lcd.c
    /*******************************************************************************
    *
    *                                _LCD_SendLCDCmd
    *
    *******************************************************************************/
    /**
    *   Call LCD_SendLCDCmd function, with the ST7637_RAMWR or ST7732_RAMWR parameter
    *
    *
    **/
    /******************************************************************************/
    void _LCD_SendLCDCmd(void)
    {
        LCD_SendLCDCmd(ST7732_RAMWR);
    }

        /* Public functions ----------------------------------------------------------*/

        /*******************************************************************************
        *
        *                                LCD_SendLCDCmd
        *
        *******************************************************************************/
        /**
        *
        *  Send on command byte to the LCD.
        *
        *  @param[in]  Cmd   An u8 containing the user command to send to the LCD.
        *
        **/
        /******************************************************************************/
        void LCD_SendLCDCmd( u8 Cmd )
            {
            /* Send command to the LCD */
            *(u16 volatile*) (LCD_CMD_MODE_ADDR) = (Cmd<<4);  
            }

        /*******************************************************************************
        *
        *                                LCD_SendLCDData
        *
        *******************************************************************************/
        /**
        *
        *  Send one data byte to the LCD.
        *
        *  @param[in]  Data  An unsigned character containing the data to send to the LCD.
        *  @pre        An LCD_SendLCDCmd was done with a command waiting for data.
        *
        *
        **/
        /******************************************************************************/
        void LCD_SendLCDData( u8 Data )
            {
            /* Transfer data to the FSMC */
            *(u16 volatile*) (LCD_DATA_MODE_ADDR) = (Data<<4);  
            }

        /***********************************************************************************
        *
        *                                LCD_ReadLCDData
        *
        ************************************************************************************/
        /**
        *
        *  Read one data byte from the LCD.
        *
        *  @return     An unsigned 32 bit word containing the data returned by a LCD command.
        *  @pre        An LCD_SendLCDCmd was done with a command returning data.
        *
        **/
        /********************************************************************************/
        u32 LCD_ReadLCDData( void )
            {
            /* Transfer data from the memory */
            return   ( ( *(u16 volatile*) (LCD_DATA_MODE_ADDR)  )  >>4) ;
            }

        /*******************************************************************************
        *
        *                                LCD_DrawPixel
        *
        *******************************************************************************/
        /**
        *
        *  Draw a pixel on the LCD with the provided color.
        *
        *  @param[in]  XPos     The horizontal coordinate of the pixel.
        *  @param[in]  YPos     The vertical coordinate of the pixel.
        *  @param[in]  Color    The RGB color to draw the pixel with.
        *
        *  @warning    The (0x0) point in on the low left corner.
        *
        **/
        /******************************************************************************/
        void LCD_DrawPixel( u8 XPos, u8 YPos, u16 Color )
            {
            /* Select LCD screen area. */
            LCD_SetRect_For_Cmd( XPos, YPos, 1, 1 );

            /* Send LCD RAM write command. */
            LCD_SendLCDCmd( ST7732_RAMWR );

            /* Draw pixel.*/
            LCD_SendLCDData( Color >> 8 );
            LCD_SendLCDData( Color );
            }

        /*******************************************************************************
        *
        *                                LCD_RectRead
        *
        *******************************************************************************/
        /**
        *
        *  Save the pixels of a rectangle part of the LCD into a RAM variable.
        *
        *  @param[in]  x        The horizontal coordinate of the rectangle low left corner.
        *  @param[in]  y        The vertical coordinate of the rectangle low left corner.
        *  @param[in]  width    The rectangle width in pixels.
        *  @param[in]  height   The rectangle height in pixels.
        *  @param[out] bmp      The variable to store the read data into.
        *
        *  @warning    One pixel weights 2 bytes.
        *  @warning    The (0x0) point in on the low left corner.
        *
        **/
        /******************************************************************************/
        void LCD_RectRead( u16 x, u16 y, u16 width, u16 height, u8* bmp )
            {
            s32 i;
            s32 bytesize = (width * height) *2; /* 2 bytes per pixel.*/

            /* Select LCD screen area. */
            LCD_SetRect_For_Cmd( x, y, width, height );

            /* Restore 18 bit color mode */
            LCD_SendLCDCmd( ST7732_COLMOD );
            LCD_SendLCDData( 0x66 );

            /* Send LCD RAM read command. */
            LCD_SendLCDCmd( ST7732_RAMRD );
 
            /* First read byte is dummy!*/
            LCD_ReadLCDData();

            /* Read pixels from LCD screen.*/
            for( i = 0; i < bytesize; i++ )
                {
                u16 red_val  =   LCD_ReadLCDData() ;
                u16 byte0 = red_val & 0xf8;   /*red: keep only 5 bits */
                u16 green_val = LCD_ReadLCDData();
                *bmp++ = (byte0 | ((green_val>>5) & 0x7) );
                u16 blue_val =  LCD_ReadLCDData();
                *bmp++ = ( ( (blue_val>>3) & 0x1F ) | ((green_val<<3)&0xE0) );
                i++; /*don't multiply by two...*/
                }
             /* Restore 16 bit color mode */
            LCD_SendLCDCmd( ST7732_COLMOD );
            LCD_SendLCDData( 0x55 );
            }

