satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Utilities/STM32_EVAL/STM32_PRIMER2/stm32_primer2_lcd.c
        /*******************************************************************************
        *
        *                                LCD_GetPixel
        *
        *******************************************************************************/
        /**
        *
        *  Read the RGB color of the pixel the coordinate are provided in parameter.
        *
        *  @param[in]  x        The horizontal coordinate of the pixel.
        *  @param[in]  y        The vertical coordinate of the pixel.
        *  @return              An unsigned 16 bit word containing the RGB color of the pixel.
        *
        *  @warning    The (0x0) point in on the low left corner.
        *  @see        LCD_RectRead
        *
        **/
        /******************************************************************************/
        u16 LCD_GetPixel( u8 x, u8 y )
            {
            u16 val;

            LCD_RectRead( x, y, 1, 1, (u8*)&val );

            return val;
            }

        /*******************************************************************************
        *
        *                                LCD_SetRect_For_Cmd
        *
        *******************************************************************************/
        /**
        *
        *  Define the rectangle for the next command to be applied.
        *
        *  @param[in]  x        The horizontal coordinate of the rectangle low left corner.
        *  @param[in]  y        The vertical coordinate of the rectangle low left corner.
        *  @param[in]  width    The rectangle width in pixels.
        *  @param[in]  height   The rectangle height in pixels.
        *
        *  @warning    The (0x0) point in on the low left corner.
        *
        **/
        /******************************************************************************/
        void LCD_SetRect_For_Cmd( s16 x, s16 y, s16 width, s16 height )
            {
            LCD_SendLCDCmd( ST7732_CASET );
            LCD_SendLCDData( 0 );
            LCD_SendLCDData( y + OrientationOffsetY[ CurrentScreenOrientation ] );
            LCD_SendLCDData( 0 );
            LCD_SendLCDData( y + OrientationOffsetY[ CurrentScreenOrientation ] + height - 1 );
            LCD_SendLCDCmd( ST7732_RASET );
            LCD_SendLCDData( 0 );
            LCD_SendLCDData( x + OrientationOffsetX[ CurrentScreenOrientation ] );
            LCD_SendLCDData( 0 );
            LCD_SendLCDData( x + OrientationOffsetX[ CurrentScreenOrientation ] + width - 1 );
            }

        /*******************************************************************************
        *
        *                                LCD_SetBackLight
        *
        *******************************************************************************/
        /**
        *
        *  Modify the PWM rate. Any value below BACKLIGHTMIN reset the value to the
        *  default value (DEFAULT_CCR_BACKLIGHTSTART).
        *
        *  @param[in]  newBacklightStart The new PWM rate.
        *
        **/
        /******************************************************************************/
        void LCD_SetBackLight( u32 newBacklightStart )
            {
            if( newBacklightStart >= BACKLIGHTMIN )
                {
                Current_CCR_BackLightStart = newBacklightStart;
                }
            else
                {
                Current_CCR_BackLightStart = DEFAULT_CCR_BACKLIGHTSTART;
                }
            }

        /*******************************************************************************
        *
        *                                LCD_SetBackLightOff
        *
        *******************************************************************************/
        /**
        *
        *  Switch the LCD back light off.
        *
        **/
        /******************************************************************************/
        void LCD_SetBackLightOff( void )
            {
            Current_CCR_BackLightStart = 0;
            }

        /*******************************************************************************
        *
        *                                LCD_SetBackLightOn
        *
        *******************************************************************************/
        /**
        *
        *  Switch the LCD back light on.
        *
        **/
        /******************************************************************************/
        void LCD_SetBackLightOn( void )
            {
            Current_CCR_BackLightStart = DEFAULT_CCR_BACKLIGHTSTART;
            }

        /*******************************************************************************
        *
        *                                LCD_GetBackLight
        *
        *******************************************************************************/
        /**
        *
        *  Returns le LCD PWM rate.
        *
        *  @return The current LCD PWM rate.
        *
        **/
        /******************************************************************************/
        u32 LCD_GetBackLight( void )
            {
            return Current_CCR_BackLightStart;
            }

        /*******************************************************************************
        *
        *                                LCD_SetRotateScreen
        *
        *******************************************************************************/
        /**
        *
        *  Enable or disable the ability of the screen display to rotate according to
        *  the MEMs information.
        *
        *  @param[in]  RotateScreen 0 to disable screen rotation and 1 to enable.
        *
        **/
        /******************************************************************************/
        void LCD_SetRotateScreen( u8 RotateScreen)
            {
            CurrentRotateScreen = RotateScreen;
            }

        /*******************************************************************************
        *
        *                                LCD_GetRotateScreen
        *
        *******************************************************************************/
        /**
        *
        *  Return the screen rotation mode.
        *
        *  @retval 0 screen rotation is disabled.
        *  @retval 1 screen rotation is enabled.
        *
        **/
        /******************************************************************************/
        u8 LCD_GetRotateScreen( void )
            {
            return CurrentRotateScreen;
            }

