satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Utilities/STM32_EVAL/STM32_PRIMER2/stm32_primer2_lcd.c
        /*******************************************************************************
        *
        *                                LCD_SetScreenOrientation
        *
        *******************************************************************************/
        /**
        *
        *  Set the screen orientation.
        *
        *  @param[in]  ScreenOrientation The new screen orientation.
        *
        **/
        /******************************************************************************/
        void LCD_SetScreenOrientation( Rotate_H12_V_Match_TypeDef ScreenOrientation )
            {
            CurrentScreenOrientation = ScreenOrientation;

            LCD_DisplayRotate( CurrentScreenOrientation );
            }

        /*******************************************************************************
        *
        *                                LCD_GetScreenOrientation
        *
        *******************************************************************************/
        /**
        *
        *  Return current screen orientation.
        *
        *  @return   A Rotate_H12_V_Match_TypeDef telling the current screen orientation.
        *
        **/
        /******************************************************************************/
        Rotate_H12_V_Match_TypeDef LCD_GetScreenOrientation( void )
            {
            return CurrentScreenOrientation;
            }

        
    /*******************************************************************************
    *
    *                                DRAW_SetImage
    *
    *******************************************************************************/
    /**
    *
    *  The provided bitmap is made width * height 2 byte words. Each 2 byte word contains
    *  the RGB color of a pixel.
    *
    *  @brief      Draw a color bitmap at the provided coordinates.
    *  @param[in]  imageptr    A pointer to an array of width * height 2 byte words.
    *  @param[in]  x           The horizontal coordinate of the low left corner of the bitmap.
    *  @param[in]  y           The vertical coordinate of the low left corner of the bitmap.
    *  @param[in]  width       The bitmap width.
    *  @param[in]  height      The bitmap height.
    *
    *  @warning       The (0x0) point in on the low left corner.
    *
    **/
    /******************************************************************************/
    void DRAW_SetImage( const u16* imageptr, u8 x, u8 y, u8 width, u8 height )
        {
        s32 i;

        /* Select screen area to access.*/
        LCD_SetRect_For_Cmd( x, y, width, height );
        _LCD_SendLCDCmd(); 
        //starting_delay(50);
        
        
        for( i = 0; i < ( width * height ); i++ )
            {
            if ( imageptr )
                {
                LCD_SendLCDData( imageptr[ i ] & 0xff );
                LCD_SendLCDData( ( imageptr[ i ] >> 8 ) & 0xff );
                }
            else
                {
                /* Bit not set: draw pixel with background color.*/
                LCD_SendLCDData( ( BackColor >> 8 ) & 0xff );
                LCD_SendLCDData( BackColor & 0xff );
                }
            }
        }

    /*******************************************************************************
    *
    *                                DRAW_SetImageSel
    *
    *******************************************************************************/
    /**
    *
    *  The provided bitmap is made width * height 2 byte words. Each 2 byte word contains
    *  the RGB color of a pixel.
    *  All pixels with the oldBgndColor are replaced with the newBgndColor
    *
    *  @brief      Draw a color bitmap at the provided coordinates, with selected background color.
    *  @param[in]  imageptr     A pointer to an array of width * height 2 byte words.
    *  @param[in]  x            The horizontal coordinate of the low left corner of the bitmap.
    *  @param[in]  y            The vertical coordinate of the low left corner of the bitmap.
    *  @param[in]  width        The bitmap width.
    *  @param[in]  height       The bitmap height.
    *  @param[in]  oldBgndColor The color of the background to replace.
    *  @param[in]  newBgndColor The new color.
    *
    *  @warning       The (0x0) point in on the low left corner.
    *
    **/
    /******************************************************************************/
    void DRAW_SetImageSel( const u16* imageptr, u8 x, u8 y, u8 width, u8 height, u16 oldBgndColor, u16 newBgndColor )
        {
        s32 i;

        /* Check the validity of the pointer*/
        if (imageptr == 0)
            return;

        /* Select screen area to access.*/
        LCD_SetRect_For_Cmd( x, y, width, height );


        /* Send command to write data on the LCD screen.*/
        _LCD_SendLCDCmd();


        for( i = 0; i < ( width * height ); i++ )
            {
                if ( imageptr[i] != oldBgndColor)
                    {
                    LCD_SendLCDData( imageptr[ i ] & 0xff );
                    LCD_SendLCDData( ( imageptr[ i ] >> 8 ) & 0xff );
                    }
                else
                    {
                    LCD_SendLCDData( ( newBgndColor >> 8 ) & 0xff );
                    LCD_SendLCDData( newBgndColor & 0xff );
                    }
            }
        }

    /*******************************************************************************
    *
    *                                DRAW_SetImageBW
    *
    *******************************************************************************/
    /**
    *
    *  The provided bitmap is made of width * height bits where a set bit means a pixel
    *  drawn in the current text color, whereas an unset bit means a pixel drawn in the
    *  current background color.
    *
    *  @brief      Draw a monochrome bitmap at the provided coordinates.
    *  @param[in]  imageptr    A pointer to an array of width * height bits.
    *  @param[in]  x           The horizontal coordinate of the low left corner of the bitmap.
    *  @param[in]  y           The vertical coordinate of the low left corner of the bitmap.
    *  @param[in]  width       The bitmap width.
    *  @param[in]  height      The bitmap height.
    *
    *  @warning       The (0x0) point in on the low left corner.
    *
    **/
    /******************************************************************************/
    void DRAW_SetImageBW( const u8* imageptr, u8 x, u8 y, u8 width, u8 height )
        {
        s32 i;
        s32 j;

        /* Select screen area to access.*/
        LCD_SetRect_For_Cmd( x, y, width, height );


        /* Send command to write data on the LCD screen.*/
        _LCD_SendLCDCmd();

