satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Utilities/STM32_EVAL/STM32_PRIMER2/stm32_primer2_lcd.c
        /* Loop on all bitmap bytes.*/
        for( i = 0; i < ( ( width * height ) / 8 ); i++ )
            {
            /* Loop on all byte bits.*/
            for( j = 0; j < 8; j++ )
                {
                /* Bit set: draw pixel with text color.*/
                if( imageptr && ( ( ( imageptr[i] ) >> ( 7 - j ) ) & 0x1 ) )
                    {
                    LCD_SendLCDData( ( TextColor >> 8 ) & 0xff );
                    LCD_SendLCDData( TextColor & 0xff );
                    }
                else
                    {
                    /* Bit not set: draw pixel with background color.*/
                    LCD_SendLCDData( ( BackColor >> 8 ) & 0xff );
                    LCD_SendLCDData( BackColor & 0xff );
                    }
                }
            }
        }

    /*******************************************************************************
    *
    *                                DRAW_Line_Circle
    *
    *******************************************************************************/
    /**
    *  Draw a line on the LCD screen. Optimized for horizontal/vertical lines,
    *  and use the Bresenham algorithm for other cases.
    *
    *  @param[in]  x1          The x-coordinate of the first line endpoint.
    *  @param[in]  x2          The x-coordinate of the second line endpoint.
    *  @param[in]  y1          The y-coordinate of the first line endpoint.
    *  @param[in]  y2          The y-coordinate of the second line endpoint.
    *  @param[in]  color       The line color.
    *
    * Rq : this fucntion does not check parameter validity
    *
    **/
    void DRAW_Line_Circle (s16 x1, s16 y1, s16 x2, s16 y2, u16 color )
        {
        s32 i,dx,dy,sdx,sdy,dxabs,dyabs,x,y,px,py;

    #define abs(X) ( ( (X) < 0 ) ? -(X) : (X) )
    #define sgn(X) ( ( (X) < 0 ) ? -1 : 1 )

        if ( x1==x2 )        /* Vertical Line*/
            {
            if ( y1 > y2 )    /* We assume y2>y1 and invert if not*/
                {
                i = y2;
                y2 = y1;
                y1 = i;
                }
            LCD_FillRect_Circle( x1, y1, 1, y2-y1+1, color );
            return;
            }
        else if ( y1==y2 )  /* Horizontal Line*/
            {
            if ( x1 > x2 )   /* We assume x2>x1 and we swap them if not*/
                {
                i = x2;
                x2 = x1;
                x1 = i;
                }
            LCD_FillRect_Circle( x1, y1, x2-x1+1, 1, color );
            return;
            }

        dx=x2-x1;      /* the horizontal distance of the line */
        dy=y2-y1;      /* the vertical distance of the line */
        dxabs=abs(dx);
        dyabs=abs(dy);
        sdx=sgn(dx);
        sdy=sgn(dy);
        x=dyabs>>1;
        y=dxabs>>1;
        px=x1;
        py=y1;

        if (dxabs>=dyabs) /* the line is more horizontal than vertical */
            {
            for(i=0;i<dxabs;i++)
                {
                y+=dyabs;
                if (y>=dxabs)
                    {
                    y-=dxabs;
                    py+=sdy;
                    }
                px+=sdx;
                LCD_DrawPixel(px,py,color);
                }
            }
        else /* the line is more vertical than horizontal */
            {
            for(i=0;i<dyabs;i++)
                {
                x+=dxabs;
                if (x>=dyabs)
                    {
                    x-=dyabs;
                    px+=sdx;
                    }
                py+=sdy;
                LCD_DrawPixel(px,py,color);
                }
            }
        }

    /*******************************************************************************
    *
    *                                DRAW_Line
    *
    *******************************************************************************/
    /**
    *  Draw a line on the LCD screen. Optimized for horizontal/vertical lines,
    *  and use the Bresenham algorithm for other cases.
    *
    *  @param[in]  x1          The x-coordinate of the first line endpoint.
    *  @param[in]  x2          The x-coordinate of the second line endpoint.
    *  @param[in]  y1          The y-coordinate of the first line endpoint.
    *  @param[in]  y2          The y-coordinate of the second line endpoint.
    *  @param[in]  color       The line color.
    *
    **/
    /******************************************************************************/
    void DRAW_Line (s16 x1, s16 y1, s16 x2, s16 y2, u16 color )
        {
        /* Rq : this fuction is just a wrapper with parameter limit checks*/

        /* Check the x parameters*/
        if (x1 < 0)
            x1 = 0;
        if (x2 < 0)
            x2 = 0;
        if (x1 > SCREEN_WIDTH-1)
            x1 = SCREEN_WIDTH-1;
        if (x2 > SCREEN_WIDTH-1)
            x2 = SCREEN_WIDTH-1;

        /* Check the y parameters*/
        if (y1 < 0)
            y1 = 0;
        if (y2 < 0)
            y2 = 0;
        if (y1 > SCREEN_HEIGHT-1)
            y1 = SCREEN_HEIGHT-1;
        if (y2 > SCREEN_HEIGHT-1)
            y2 = SCREEN_HEIGHT-1;

        /* Call the native function*/
        DRAW_Line_Circle (x1, y1, x2, y2, color );

        }

    /**
      * @brief  Sets the LCD Text and Background colors.
      * @param  _TextColor: specifies the Text Color.
      * @param  _BackColor: specifies the Background Color.
      * @retval None
      */
    void LCD_SetColors(__IO uint16_t _TextColor, __IO uint16_t _BackColor)
    {
      TextColor = _TextColor; 
      BackColor = _BackColor;
    }

    /**
      * @brief  Gets the LCD Text and Background colors.
      * @param  _TextColor: pointer to the variable that will contain the Text 
                Color.
      * @param  _BackColor: pointer to the variable that will contain the Background 
                Color.
      * @retval None
      */
    void LCD_GetColors(__IO uint16_t *_TextColor, __IO uint16_t *_BackColor)
    {
      *_TextColor = TextColor; *_BackColor = BackColor;
    }

    /**
      * @brief  Sets the Text color.
      * @param  Color: specifies the Text color code RGB(5-6-5).
      * @retval None
      */
    void LCD_SetTextColor(__IO uint16_t Color)
    {
      TextColor = Color;
    }

    /**
      * @brief  Sets the Background color.
      * @param  Color: specifies the Background color code RGB(5-6-5).
      * @retval None
      */
    void LCD_SetBackColor(__IO uint16_t Color)
    {
      BackColor = Color;
    }

    /**
      * @brief  Clears the whole LCD.
      * @param  Color: the color of the background.
      * @retval None
      */
    void LCD_Clear(uint16_t Color)
    {
      uint32_t index = 0;
      
      /* Select screen area to access.*/
      LCD_SetRect_For_Cmd( 0, 0, SCREEN_WIDTH, SCREEN_HEIGHT );

      /* Select LCD output mode.*/
      LCD_SendLCDCmd( ST7732_RAMWR );

      for(index = 0; index < (SCREEN_WIDTH * SCREEN_HEIGHT); index++)
      {
        LCD_SendLCDData( Color >> 8 );        
        LCD_SendLCDData( Color );
      }  
    }

