satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Utilities/STM32_EVAL/STM32_PRIMER2/stm32_primer2_lcd.c
    /*******************************************************************************
    *
    *                                LCD_DrawChar_Circle
    *
    *******************************************************************************/
    /**
    *  Draw a character on the LCD screen.
    *
    *  @param[in]  x           The line where to display the character shape.
    *  @param[in]  y           The column start address.
    *  @param[in]  width       The number of columns (dots) in a character width.
    *  @param[in]  bmp         The character (monochrome) bitmap. A pointer of the dot matrix data.
    *  @param[in]  textColor   The character color.
    *  @param[in]  bGndColor   The character background color.
    *  @param[in]  charMagniCoeff The character magnifying coefficient.
    *
    *  @warning    The (0x0) point in on the low left corner.
    *
    **/
    /******************************************************************************/
    void LCD_DrawChar_Circle( u8 x, u8 y, u8 width, const u8* bmp, u16 textColor, u16 bGndColor, u16 charMagniCoeff )
        {
        s32 i, i0 = 0, i1 = 7;
        s32 j;
        s32 k1;
        s32 k2;
        #define MAX(i,j) (((i)>(j))?(i):(j))
        #define MIN(i,j) (((i)<(j))?(i):(j))
        s32 x0 = MAX(x, CharFilter_XMin);
        s32 y0 = MAX(y, CharFilter_YMin);
        static s32 width0, height0 ;
        width0 = MIN(CHAR_WIDTH * charMagniCoeff,  CharFilter_XMax - x0 );
        height0 = MIN(CHAR_HEIGHT * charMagniCoeff,  CharFilter_YMax - y0 );
        if ( y0 > y ) 
            height0 -= (y0-y);
        if ( x0 > x ) 
            width0 -= (x0-x);
        
        static s32 lin0;
        static s32 lin1;
        
        if ( (width0 <= 0) || (height0 <= 0) ) 
            return;
        

        /* Select the area for LCD output.*/
        LCD_SetRect_For_Cmd( x0, y0, width0, height0);

        /* Select LCD output mode.*/
        LCD_SendLCDCmd( ST7732_RAMWR );

        i0 = (x0 - x) / charMagniCoeff;
        i1 = width0 / charMagniCoeff;
        lin0 = (y0 - y) ;
        lin1 = height0 + lin0;

        for( i = i0; i < i1; i++ )
            {
            for( k1 = 0; k1 < charMagniCoeff; k1++ )
                {
                s32 n = 0;
                for( j = 0x80; j; j >>= 1 ) // 8
                    {
                    for( k2 = 0; k2 < charMagniCoeff; k2++ , n++)
                        {
                        if ( ( n < lin0 ) || (n>=lin1) ) continue;                           
                        LCD_SendLCDData( ( bmp[2*i] & j ) ? ( textColor >> 8  ) : ( bGndColor >> 8 ) );
                        LCD_SendLCDData( ( bmp[2*i] & j ) ? ( textColor & 255 ) : ( bGndColor &  255 ) );
                        }
                    }

                for( j = 0x80; j > 2; j >>= 1 )  // 8
                    {
                    for( k2 = 0; k2 < charMagniCoeff; k2++ , n++)
                        {
                        if ( ( n < lin0 ) || (n>=lin1) ) continue;
                        LCD_SendLCDData( ( bmp[2*i+1] & j ) ? ( textColor >> 8  ) : ( bGndColor >> 8 ) );
                        LCD_SendLCDData( ( bmp[2*i+1] & j ) ? ( textColor & 255 ) : ( bGndColor & 255 ) );
                        }
                    }
                }
            }
        }

    /*******************************************************************************
    *
    *                                DRAW_DisplayChar_Circle
    *
    *******************************************************************************/
    /**
    *
    *  Display at provided coordinates the provided ASCII character with the provided
    *  text and background colors and with the provided magnify coefficient.
    *
    *  @param[in]  x              The horizontal coordinate of the character.
    *  @param[in]  y              The vertical coordinate of the character.
    *  @param[in]  Ascii          The ASCII code of the character to display.
    *                             @n Ascii must be higher than 31 and lower than 255.
    *  @param[in]  TextColor      The color used to draw the character.
    *  @param[in]  BGndColor      The background color of the drawn character.
    *  @param[in]  CharMagniCoeff The magnify coefficient used to draw the character.
    *
    *  @warning    The (0x0) point in on the low left corner.
    *
    **/
    /******************************************************************************/
    void DRAW_DisplayChar_Circle( u8 x, u8 y, u8 Ascii, u16 TextColor, u16 BGndColor, u16 CharMagniCoeff)
        {
        /* Display the selected bitmap according to the provided ASCII character.*/
        LCD_DrawChar_Circle( x, y, CHAR_WIDTH, (u8*)&CurrentFont[ (Ascii-32) * CHAR_HEIGHT ], TextColor, BGndColor, CharMagniCoeff );
        }

    /*******************************************************************************
    *
    *                                DRAW_DisplayStringWithMode_Circle
    *
    *******************************************************************************/
    /**
    *
    *  This function is used to display a character string (17 char max)
    *  at given X, Y coordinates on the LCD display.
    *  Note:
    *  This function is the user interface to use the LCD driver.
    *
    *  @param[in] x      The horizontal coordinate of the string.
    *  @param[in] y      The vertical coordinate of the string.
    *  @param[in] *ptr   Pointer to the string.
    *  @param[in] len    String length i.e., number of characters to display.
    *  @param[in]  mode  Display mode: 0 normal, 1 inverted colors.
    *
    *  @note          Characters are displayed as 7x14 pixels blocks.
    *  @warning       The (0x0) point in on the low left corner.
    *
    *  @see           DRAW_DisplayString
    *  @see           DRAW_DisplayStringInverted
    *
    **/
    /******************************************************************************/
    void DRAW_DisplayStringWithMode_Circle( u8 x, u8 y, const u8* ptr, u8 len, s32 mode )
        {
        u8 ref_x = x, i = 0, c;

        /* Up to 23 characters*/
        if ( len >= 23 )
            {
            len = 23;
            }

        /* Display each character on LCD */
        for ( i = 0 ; i < len ; i++ )
            {
            c = *ptr;
            if ( c )
                {
                ptr++;      /* Point to the next character */
                }
            else
                {
                c = ' ';    /* fill with space when len exceeds strlen(ptr) */
                }
            /* Display one character on LCD */
            DRAW_DisplayChar_Circle( ref_x, y, c, mode ? BackColor : TextColor,  mode ? TextColor : BackColor, CharMagniCoeff );

            /* Increment the column position by 7 */
            ref_x+= (CHAR_WIDTH * CharMagniCoeff);
            }
        }

