satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Utilities/STM32_EVAL/STM32_PRIMER2/stm32_primer2_lcd.c
    /*******************************************************************************
    *
    *                                DRAW_DisplayString_Circle
    *
    *******************************************************************************/
    /**
    *
    *  This function is used to display a character string (17 u8 max)
    *  at given X, Y coordinates on the LCD display.
    *
    *  @param[in] x      The horizontal coordinate of the string.
    *  @param[in] y      The vertical coordinate of the string.
    *  @param[in] *ptr   Pointer to the string.
    *  @param[in] len    String length i.e., number of characters to display.
    *
    *  @note          Characters are displayed as 7x14 pixels blocks.
    *  @warning       The (0x0) point in on the low left corner.
    *
    **/
    /******************************************************************************/
    void DRAW_DisplayString_Circle( u8 x, u8 y, const u8* ptr, u8 len )
        {
        DRAW_DisplayStringWithMode_Circle( x, y, ptr, len, 0 );
        }

    /*******************************************************************************
    *
    *                                DRAW_DisplayStringInverted_Circle
    *
    *******************************************************************************/
    /**
    *
    *  This function is used to display a character string (17 char max)
    *  at given X, Y coordinates on the LCD display, with inverted colors.
    *
    *  @param[in] x      The horizontal coordinate of the string.
    *  @param[in] y      The vertical coordinate of the string.
    *  @param[in] *ptr   Pointer to the string.
    *  @param[in] len    String length i.e., number of characters to display.
    *
    *  @note          Characters are displayed as 7x14 pixels blocks.
    *  @warning       The (0x0) point in on the low left corner.
    *
    **/
    /******************************************************************************/
    void DRAW_DisplayStringInverted_Circle( u8 x, u8 y, const u8* ptr, u8 len )
        {
        //BackGround and Text Colors are inverted
        DRAW_DisplayStringWithMode_Circle( x, y, ptr, len, 1 );
        }

    /**
      * @brief  Displays one character (16dots width, 24dots height).
      * @param  Line: the Line where to display the character shape .
      *   This parameter can be one of the following values:
      *     @arg Linex: where x can be 0..9
      * @param  Column: start column address.
      * @param  Ascii: character ascii code, must be between 0x20 and 0x7E.
      * @retval None
      */
    void LCD_DisplayChar(uint8_t Line, uint16_t Column, uint8_t Ascii)
    {
      LCD_DrawChar_Circle(Column, Line, CHAR_WIDTH, (u8*)&CurrentFont[ (Ascii-32) * CHAR_HEIGHT ], TextColor, BackColor, CharMagniCoeff );
    }


    /**
      * @brief  Displays a maximum of 20 char on the LCD.
      * @param  Line: the Line where to display the character shape .
      *   This parameter can be one of the following values:
      *     @arg Linex: where x can be 0..9
      * @param  *ptr: pointer to string to display on LCD.
      * @retval None
      */
    void LCD_DisplayStringLine(uint8_t Line, uint8_t *ptr)
    {
      uint16_t refcolumn = 0;
      LCD_DisplayChar(Line, refcolumn, ' ');   
      refcolumn += CHAR_WIDTH;        
      /* Send the string character by character on lCD */
      while (refcolumn < SCREEN_WIDTH)
      {
        if(*ptr != 0)
        {
            /* Display one character on LCD */
            LCD_DisplayChar(Line, refcolumn, *ptr);
            /* Point on the next character */
            ptr++;
        }
        else
        {
            LCD_DisplayChar(Line, refcolumn, ' ');
        }
        /* Increment the column position by the current font width */
        refcolumn += CHAR_WIDTH;
      }
    }

    void LCD_DisplayStringLineColumn(uint8_t Line, uint16_t Column, uint8_t *ptr, int8_t Length)
    {
      int8_t i = 0;
      uint16_t refcolumn = Column;
      /* Send the string character by character on lCD */
      while (refcolumn < SCREEN_WIDTH)
      {
        if((Length >= 0) && (i >= Length))
            break;
        
        if(*ptr != 0)
        {
            /* Display one character on LCD */
            LCD_DisplayChar(Line, refcolumn, *ptr);
            /* Point on the next character */
            ptr++;
        }
        else
        {
            LCD_DisplayChar(Line, refcolumn, ' ');
        }
        /* Increment the column position by the current font width */
        refcolumn += CHAR_WIDTH;
        /* Increment character count */
        i++;
      }
    }

    /**
      * @brief  Clears the selected line.
      * @param  Line: the Line to be cleared.
      *   This parameter can be one of the following values:
      *     @arg Linex: where x can be 0..n
      * @retval None
      */
    void LCD_ClearLine(uint8_t Line)
    {
      uint16_t refcolumn = 0;   
      LCD_DisplayChar(Line, refcolumn, ' ');   
      refcolumn += CHAR_WIDTH;        
      /* Send the string character by character on lCD */
      while (refcolumn < SCREEN_WIDTH)
      {
        /* Display one character on LCD */
        LCD_DisplayChar(Line, refcolumn, ' ');
        /* Increment the column position by the current font width */
        refcolumn += CHAR_WIDTH;
      }
    }

void LCD_DrawRect(uint8_t Xpos, uint16_t Ypos, uint8_t Height, uint16_t Width)
{
    LCD_DrawRect_Circle(Ypos, Xpos, Width, Height, TextColor);
}